Tekla.Structures.Analysis.AnalysisPartEnd.EccentricityModeEnum
The eccentricity modes of the part end.

Tekla.Structures.Analysis.AnalysisPartEnd.EccentricityModeEnum.ECCENTRICITY_MODE_MANUAL
The manual eccentricity mode.

Tekla.Structures.Analysis.AnalysisPartEnd.EccentricityModeEnum.ECCENTRICITY_MODE_AUTOMATIC
The automatic eccentricity mode.